---
kind: method
id: M:Autodesk.Revit.UI.UIView.ZoomToFit
source: html/535f4910-37e0-0f46-924a-443899587d95.htm
---
# Autodesk.Revit.UI.UIView.ZoomToFit Method

Zoom the view to fit its contents.

## Syntax (C#)
```csharp
public void ZoomToFit()
```